tap "asmvik/formulae", "https://github.com/asmvik/homebrew-formulae.git"
tap "buo/cask-upgrade", trusted: true
tap "duongductrong/snapzy", "https://github.com/duongductrong/Snapzy"
tap "felixkratz/formulae", "https://github.com/FelixKratz/homebrew-formulae"
tap "garethgeorge/backrest-tap"
tap "homebrew/bundle"
tap "josejuanqm/tap"
tap "kamillobinski/thock"
tap "nikitabobko/tap"
tap "smudge/smudge"
tap "supabase/tap"
# Recompression utilities for .PNG, .MNG, .ZIP, and .GZ files
brew "advancecomp"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# C string library for manipulating Unicode strings
brew "libunistring"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Core application library for C
brew "glib"
# General-purpose data compression with high compression ratio
brew "xz"
# TIFF library and utilities
brew "libtiff"
# OpenType text shaping engine
brew "harfbuzz"
# Library to render SVG files using Cairo
brew "librsvg"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Connect and disconnect Bluetooth devices
brew "bluetoothconnector"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Color management engine supporting ICC profiles
brew "little-cms2"
# New file format for still image compression
brew "jpeg-xl"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Isolated development environments using Docker
brew "docker-compose"
# CLI tool for Dolby Vision metadata on video streams
brew "dovi_tool"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Plugin manager for the Fish shell
brew "fisher"
# Lightweight scripting language for querying databases
brew "flux"
# Generic library support script
brew "libtool"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# GNU database manager
brew "gdbm"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# GIF image/animation creator/editor
brew "gifsicle"
# Distributed revision control system
brew "git"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Git extension for versioning large files
brew "git-lfs"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Image processing tools collection
brew "graphicsmagick"
# GNU grep, egrep and fgrep
brew "grep"
# Add GitHub support to git on the command-line
brew "hub"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Tool for managing apps on iOS devices
brew "ideviceinstaller"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Sudoless performance monitoring for Apple Silicon processors
brew "macmon"
# Multiple Arcade Machine Emulator
brew "mame"
# Mac App Store command-line interface
brew "mas"
# Unified display of technical and tag data for audio/video
brew "media-info"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Music Player Daemon
brew "mpd"
# Open source relational database management system
brew "mysql"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Graphical client for the Soulseek peer-to-peer network
brew "nicotine-plus"
# Port scanning utility for large networks
brew "nmap"
# PNG file optimizer
brew "optipng"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Perl compatible regular expressions library
brew "pcre"
# General-purpose scripting language
brew "php"
# Optimizer for PNG files
brew "pngcrush"
# PNG image optimizing utility
brew "pngquant"
# Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql@14"
# Pretty, minimal and fast ZSH prompt
brew "pure"
# Generic machine emulator and virtualizer
brew "qemu"
# Fast, efficient and secure backup program
brew "restic"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Tools for Multiple Arcade Machine Emulator
brew "rom-tools"
# Utility that provides fast incremental file transfer
brew "rsync"
# Safe, concurrent, practical language
brew "rust"
# Get, set, and list display resolution
brew "screenresolution"
# SMART hard drive monitoring
brew "smartmontools"
# SOcket CAT: netcat on steroids
brew "socat"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Scriptable music downloader for Qobuz, Tidal, SoundCloud, and Deezer
brew "streamrip"
# Open source continuous file synchronization application
brew "syncthing", link: false
# User interface to the TELNET protocol
brew "telnet"
# Enables extra languages support for Tesseract
brew "tesseract-lang"
# Terminal multiplexer
brew "tmux"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Watch files and take action when they change
brew "watchman"
# Convert HTML to PDF
brew "weasyprint"
# Internet file retriever
brew "wget"
# VNC server for real X displays
brew "x11vnc"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar", trusted: true
# Backrest is a web UI and orchestrator for restic backup.
brew "garethgeorge/backrest-tap/backrest", trusted: true
# Thock your mac keyboard
brew "kamillobinski/thock/thock", trusted: true
# A CLI for configuring 'Night Shift' on macOS 🌕🌖🌗🌘🌑
brew "smudge/smudge/nightlight", trusted: true
# Supabase CLI
brew "supabase/tap/supabase", trusted: true
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Note editor and whiteboard
cask "affine"
# Application launcher and productivity software
cask "alfred"
# Enable Windows-like alt-tab
cask "alt-tab"
# Memory training application
cask "anki"
# Agent orchestration platform
cask "antigravity"
# Terminal interface for Antigravity agents
cask "antigravity-cli"
# Local-first and end-to-end encrypted notes app
cask "anytype"
# Application uninstaller
cask "appcleaner"
# Chromium based browser
cask "arc"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Menu bar icon organiser
cask "bartender"
# Display management tool
cask "betterdisplay"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
# Web browser focusing on privacy
cask "brave-browser"
# E-books management software
cask "calibre"
# Hard disk backup and cloning utility
cask "carbon-copy-cloner"
# Desktop app for GPT-4 / GPT-3.5 (OpenAI API)
cask "chatbox"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Screen capturing tool
cask "cleanshot"
# Image, video and clipboard optimiser
cask "clop"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Mount network shares quick and easy
cask "connectmenow"
# Track and budget money
cask "copilot-money"
# Write, edit, and chat about your code with AI
cask "cursor"
# Disk space visualiser
cask "daisydisk"
# Collect, organise, edit and annotate documents
cask "devonthink"
# All-in-one toolbox for developers
cask "devutils"
# Visually compare and merge files
cask "diffmerge"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Configurable Dock replacement with widgets, Launchpad and a window switcher
cask "josejuanqm/tap/docky", trusted: true
# Music player
cask "doppler-app"
# Online diagram software
cask "drawio"
# Drive health diagnostic & monitoring tool
cask "drivedx"
# Outlining app for your work
cask "dynalist"
# Bitcoin thin client
cask "electrum"
# Web browser
cask "firefox"
# Web browser
cask "firefox@developer-edition"
cask "font-hack-nerd-font"
# Audio player
cask "foobar2000"
# GIT client
cask "fork"
# Finder replacement and FTP, SFTP, WebDAV and Amazon s3 client
cask "forklift"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Git client focusing on productivity
cask "gitkraken"
# Git interface focused on visual interaction
cask "gitup-app"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Open-source video transcoder
cask "handbrake-app"
# Link and retrieve key information
cask "hookmark"
# Convert your caps lock key or any of your modifier keys to the hyper key
cask "hyperkey"
# Free and open-source media player
cask "iina"
# Tool to optimise images to a smaller size
cask "imageoptim"
# iPhone management application
cask "imazing"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Menu bar manager
cask "jordanbaird-ice"
# Open-source screen recorder built with web technology
cask "kap"
# Keyboard customiser
cask "karabiner-elements"
# Password manager app
cask "keepassxc"
# File archiver
cask "keka"
# Automation software
cask "keyboard-maestro"
# Find shortcuts for any installed application
cask "keyclu"
# Create, manage and debug system and user services
cask "launchcontrol"
# App to manage software development and track bugs
cask "linear"
# Discover, download, and run local LLMs
cask "lm-studio"
# Open-source Markdown editor
cask "macdown"
# File system integration
cask "macfuse"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Detailed information on every Apple product ever made
cask "mactracker"
# Open-source Dropbox client
cask "maestral"
# Video format converter (transcoder)
cask "makemkv"
# Scan and remove malware, spyware, and viruses
cask "malwarebytes"
# Extensible two-pane file manager
cask "marta"
# Display technical and tag data for video and audio files
cask "mediainfo"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
# Remote desktop client
cask "microsoft-remote-desktop"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Minimal installer for conda
cask "miniconda"
# Utility that automatically downloads firmwares and installers
cask "mist"
# GUI including a set of tools to create, alter and inspect Matroska files (MKV)
cask "mkvtoolnix-app"
# Music tagger
cask "musicbrainz-picard"
# Free and open-source RSS reader
cask "netnewswire"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calendar for professionals and teams
cask "notion-calendar"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Get up and running with large language models locally
cask "ollama-app"
# Cloud storage client
cask "onedrive"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Retro video game emulation
cask "openemu"
# WebKit based web browser
cask "orion"
# File manager
cask "path-finder"
# Home media server
cask "plex-media-server"
# Collaboration platform for API development
cask "postman"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Binary newsreader
cask "sabnzbd"
# Screen recorder and editor
cask "screen-studio"
# Block your own access to distracting websites
cask "selfcontrol"
# Screenshot measurement and annotation tool
cask "shottr"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Git client
cask "smartgit"
# Native macOS screenshots, recording, annotation, and editing from the menu bar
cask "duongductrong/snapzy/snapzy"
# File sharing network
cask "soulseek"
# Graphical client for Git version control
cask "sourcetree"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Open-source media center
cask "stremio"
# Git client
cask "sublime-merge"
# Text editor for code, markup and prose
cask "sublime-text"
# Controls screen display settings
cask "switchresx"
# Real time file synchronisation software
cask "syncthing-app"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Messaging app with a focus on speed and security
cask "telegram"
# Menu bar manager
cask "thaw"
# Desktop client for TD Ameritrade trading platform
cask "thinkorswim"
# Customizable email client
cask "thunderbird"
# To-do & task list manager
cask "ticktick"
# Menu bar pomodoro timer
cask "tomatobar"
# Batch rename utility
cask "transnomino"
# Hierarchical note taking application
cask "trilium-notes"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Create, manage, and run virtual machines
cask "vmware-fusion"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# VPN client for secure internet access and private browsing
cask "windscribe"
# Lossless audio decoder
cask "xld"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Amperfy", id: 1530145038
mas "Amphetamine", id: 937984704
mas "Anybox", id: 1593408455
mas "Bitdefender Virus Scanner", id: 500154009
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Calendars", id: 608834326
mas "Cardhop", id: 1290358394
mas "CrystalFetch", id: 6454431289
mas "Fantastical", id: 975937182
mas "FBReader", id: 1067172178
mas "HP", id: 1474276998
mas "Infuse", id: 1136220934
mas "Itsyhome", id: 6758070650
mas "Keynote", id: 409183694
mas "Mela", id: 1568924476
mas "Microsoft Outlook", id: 985367838
mas "Microsoft To Do", id: 1274495053
mas "Notability", id: 360593530
mas "Notion Web Clipper", id: 1559269364
mas "Numbers", id: 361304891
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Parcel Classic", id: 639968404
mas "PDFgear", id: 6469021132
mas "Raivo OTP", id: 1498497896
mas "ReadKit", id: 1615798039
mas "Save to Raindrop.io", id: 1549370672
mas "Shazam", id: 897118787
mas "Spark", id: 1176895641
mas "Spark Desktop", id: 6445813049
mas "Speedtest", id: 1153157709
mas "Steam Link", id: 1246969117
mas "Streaks", id: 963034692
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "Todoist", id: 585829637
mas "Under My Roof", id: 1524335878
mas "Yomu", id: 562211012
vscode "anthropic.claude-code"
vscode "arrterian.nix-env-selector"
vscode "austenc.tailwind-docs"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "file-icons.file-icons"
vscode "formulahendry.code-runner"
vscode "github.vscode-github-actions"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "google.geminicodeassist"
vscode "jakob101.relativepath"
vscode "jnoortheen.nix-ide"
vscode "k--kato.intellij-idea-keybindings"
vscode "kevinrose.vsc-python-indent"
vscode "leizongmin.node-module-intellisense"
vscode "mechatroner.rainbow-csv"
vscode "mkhl.direnv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "octref.vetur"
vscode "pinage404.nix-extension-pack"
vscode "pranaygp.vscode-css-peek"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "rlivings39.fzf-quick-open"
vscode "saoudrizwan.claude-dev"
vscode "sourcegraph.amp"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "tomrijndorp.find-it-faster"
vscode "twxs.cmake"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "wholroyd.jinja"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "zignd.html-css-class-completion"
npm "@anthropic-ai/claude-code"
npm "@qwen-code/qwen-code"
npm "md-to-pdf"
